[
  {
    "serviceId": 1,
    "serviceName": "Winter Coat Fitting for Dogs",
    "providerName": "PawCare Studio",
    "providerEmail": "info@pawcare.com",
    "price": 25,
    "rating": 4.9,
    "slotsAvailable": 4,
    "description": "Keep your furry friend warm and stylish this winter with our custom coat fitting service. We take accurate measurements to ensure a perfect fit for every dog, from small breeds to large companions. Our winter outfits are made from high-quality, insulated materials that protect pets from chilly winds and low temperatures. Each fitting includes a comfort test, style recommendation, and options for waterproof or fleece-lined designs to keep your dog cozy throughout the season.",
    "image": "https://i.ibb.co.com/7tHzLw2C/rsz-22148348064.jpg",
    "category": "Clothing"
  },
  {
    "serviceId": 2,
    "serviceName": "Winter Grooming & Paw Treatment",
    "providerName": "Furry Friends Spa",
    "providerEmail": "contact@furryfriendsspa.com",
    "price": 35,
    "rating": 4.8,
    "slotsAvailable": 5,
    "description": "Our winter grooming package is specially designed to protect your pet’s skin and paws from the harsh cold. This service includes a gentle warm bath using winter-safe shampoo, deep moisturizing paw balm application, and fur trimming for easier coat maintenance. We also provide de-shedding and conditioning treatments to prevent dryness and irritation caused by indoor heating. Your pet leaves clean, hydrated, and ready to enjoy the winter season in total comfort.",
    "image": "https://i.ibb.co.com/0pN4R7P8/rsz-12148949394.jpg",
    "category": "Grooming"
  },
  {
    "serviceId": 3,
    "serviceName": "Heated Kennel Stay for Pets",
    "providerName": "WarmPaws Boarding",
    "providerEmail": "support@warmpaws.com",
    "price": 40,
    "rating": 4.7,
    "slotsAvailable": 5,
    "description": "When the temperature drops, keep your pets safe and comfortable with our premium heated kennel service. Each kennel is equipped with a temperature-controlled heating system, soft bedding, and insulated walls to maintain the perfect cozy environment. Our caretakers provide 24/7 supervision, regular feeding schedules, and gentle winter walks for exercise. Ideal for pet parents traveling during winter, this service ensures warmth, safety, and personalized attention for every guest.",
    "image": "https://i.ibb.co.com/wNvkGDc2/H0855d8bf6cb242aba8a49d250b754d72-F.jpg",
    "category": "Boarding"
  },
  {
    "serviceId": 4,
    "serviceName": "Winter Health Checkup & Supplements",
    "providerName": "PetWell Clinic",
    "providerEmail": "care@petwell.com",
    "price": 35,
    "rating": 4.9,
    "slotsAvailable": 6,
    "description": "Our winter wellness checkup focuses on keeping your pet’s immune system strong during the colder months. The session includes a full physical exam, temperature monitoring, skin and joint evaluation, and advice on proper nutrition for winter. We also provide natural immune-boosting supplements, multivitamins, and grooming tips to prevent dryness or infections. This service is perfect for older pets or those sensitive to weather changes, ensuring they stay healthy and active all winter long.",
    "image": "https://i.ibb.co.com/1fpssnqq/rsz-12149314336.jpg",
    "category": "Healthcare"
  },
  {
    "serviceId": 5,
    "serviceName": "Winter Nutritional Consultation",
    "providerName": "HealthyPaws Nutrition",
    "providerEmail": "info@healthypaws.com",
    "price": 30,
    "rating": 4.8,
    "slotsAvailable": 6,
    "description": "Ensure your pet’s diet meets their winter energy needs. Our nutrition experts assess your pet’s weight, breed, and activity level to create a personalized meal plan rich in protein, healthy fats, and vitamins. We also recommend supplements that support skin hydration, joint health, and immunity for the colder months.",
    "image": "https://i.ibb.co.com/ksfW742q/rsz-1rsz-11761372646.jpg",
    "category": "Consultation"
  },
  {
    "serviceId": 6,
    "serviceName": "Emergency Winter Pet Rescue & Care",
    "providerName": "SafeTail Rescue Team",
    "providerEmail": "help@safetailrescue.com",
    "price": 50,
    "rating": 5.0,
    "slotsAvailable": 2,
    "description": "Our emergency winter pet rescue service provides on-call assistance for pets exposed to extreme weather. We offer safe pickup, heated shelter, medical checkups, and post-recovery grooming. Ideal for strays or lost pets during snowfalls, this compassionate service ensures every animal receives warmth, food, and immediate care.",
    "image": "https://i.ibb.co.com/zgp8bps/hh.jpg",
    "category": "Rescue & Emergency"
  }
]
